// Создать примитивный англо-русский словарь и русско-английский словарь
// содержащий пару слов - названий стран на русском и ангийском языках
// Пользователь должен выбирать направление перевода и запрашивать перевод

map MyEnum
{
    Afghanistan = Афганистан,
    Albania = Албания,
    Algeria = Алжир,
    Andorra = Андорра,
    Angola = Ангола,
    Antigua and Barbuda = Антигуа и Барбуда,
    Argentina = Аргентина,
    Armenia = Армения,
    Australia = Австралия,
    Austria = Австрия,
    Azerbaijan = Азербайджан,

}